//
//  Privacy.swift
//  Kindy
//
//  Created by baek seohyeon on 2022/10/24.
//

import Foundation

// TODO: 이용약관과 라이선스, 본문을 추가해야합니다.
struct Privacy {

    let license: String = """
    - Firebase Apple Open Source Development:
    https://github.com/firebase/firebase-ios-sdk
    """
    
    let privacyPolicy: String = """
    < 샌들즈 >('https://github.com/DeveloperAcademy-POSTECH/MacC-T'이하 '샌들즈')은(는) 「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.

    ○ 이 개인정보처리방침은 2022년 10월 30부터 적용됩니다.


    ### 제1조(개인정보의 처리 목적)

    < 샌들즈 >('https://github.com/DeveloperAcademy-POSTECH/MacC-T'이하 '샌들즈')은(는) 앱 기능(사용자 인증) 과 제품 개인 맞춤화(위치정보를 이용한 추천)을 위해 개인정보를 처리합니다.

    ### 제2조(개인정보의 처리 및 보유 기간)

    < 샌들즈 >은(는) 정보주체로부터 동의 받은 개인정보를 기기에서만 처리하고, 보유, 수집하지 않습니다.

    ### 제3조(처리하는 개인정보의 항목)

    < 샌들즈 >은(는) 사용자 인증을 위해 이메일과, 사용자의 위치를 파악하여 서점을 추천하기 위해 위치 권한을 요청합니다.

    ### 제4조(개인정보의 제3자 제공에 관한 사항)

    < 샌들즈 >은(는) 개인정보를 제3자에게 제공하지 않습니다.

    ### 제5조(개인정보처리의 위탁에 관한 사항)

    < 샌들즈 >은(는) 개인정보를 위탁하지 않습니다.


    ## 제6조(개인정보의 파기절차 및 파기방법)

    ① < 샌들즈 > 은(는) 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.

    ② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
    1. 법령 근거 :
    2. 보존하는 개인정보 항목 :

    ③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
    1. 파기절차
    < 샌들즈 > 은(는) 파기 사유가 발생한 개인정보를 선정하고, < 샌들즈 > 의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.

    2. 파기방법

    전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다


    ## 제7조(정보주체와 법정대리인의 권리·의무 및 그 행사방법에 관한 사항)


    ① 정보주체는 샌들즈에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.

    ② 제1항에 따른 권리 행사는샌들즈에 대해 「개인정보 보호법」 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 샌들즈은(는) 이에 대해 지체 없이 조치하겠습니다.

    ③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다.이 경우 “개인정보 처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.

    ④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.

    ⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.

    ⑥ 샌들즈은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.


    ## 제8조(개인정보의 안전성 확보조치에 관한 사항)

    < 샌들즈 >은(는) 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.

    1. 개인정보에 대한 접근 제한
    개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.

    2.비인가자에 대한 출입 통제
    개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.


    ## 제9조(개인정보를 자동으로 수집하는 장치의 설치·운영 및 그 거부에 관한 사항)

    1. 정보주체에 보다 나은 서비스의 제공을 위하여 구글(Google)에서 제공하는 앱 이벤트 분석 도구인 구글 애널리틱스 4를 이용하고 있습니다. 구글 애널리틱스는 쿠키(Cookie) 및 이벤트 로그를 통하여 당사 앱 이용자의 행태정보를 수집하게 되며, 이 경우 이용자 개인을 식별할 수 없는 비식별정보 만이 수집됩니다. 그럼에도 이용자는 부가기능 설치 또는 웹브라우저의 쿠키 설정 거부를 통해 구글 애널리틱스의 쿠키 이용을 거부할 수 있습니다.
        - 구글 애널리틱스 차단 브라우저 부가기능의 설치(https://tools.google.com/dlpage/gaoptout)

    ## 제10조 (개인정보 보호책임자에 관한 사항)

    ① 샌들즈 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

    ▶ 개인정보 보호책임자
    성명 :조규재
    직책 :사원
    직급 :사원
    연락처 : teamsandalsofficial@gmail.com
    ※ 개인정보 보호 담당부서로 연결됩니다.

    ## 제12조(정보주체의 권익침해에 대한 구제방법)

    정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.

    1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
    2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
    3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr)
    4. 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)

    「개인정보보호법」제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의 규정에 의한 요구에 대 하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.

    ※ 행정심판에 대해 자세한 사항은 중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.

    ## 제13조(개인정보 처리방침 변경)

    ① 이 개인정보처리방침은 2022년 10월 30부터 적용됩니다.


"""
    
    let memberPolicy: String = """
    **제 1조 목적**

    본 약관은 회원(본 약관에 동의한 자를 말합니다. 이하 “회원“)이 **샌들즈**가 제공하는 앱 콘텐츠(이하 “콘텐츠“)를 이용함에 있어 회사와 회원간의 이용 조건 및 제반 절차, 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

    **제 2조 용어의 정의**

    이 약관에서 사용하는 용어의 정의는 아래와 같습니다.

    1. “앱“이라 함은 샌들즈가 콘텐츠를 “회원“에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 설정한 가상의 영업장 또는 샌들즈가 운영하는 앱콘텐츠를 제공하는 모든 매체를 통칭합니다.
    2. "콘텐츠"라 함은 정보통신망이용촉진 및 정보보호 등에 관한 법률 제2조 제1항 제1호의 규정에 의한 정보통신망에서 사용되는 부호·문자·음성·음향·이미지 또는 영상 등으로 표현된 자료 또는 정보로서, 그 보존 및 이용에 있어서 효용을 높일 수 있도록 전자적 형태로 제작 또는 처리된 것을 말합니다.
    3. “회원“이라 함은 샌들즈가 제공하는 콘텐츠를 이용하거나 이용하려는 자로, Apple 등 외부 서비스 연동을 통해 샌들즈와 이용계약을 체결한 자 또는 체결하려는 자를 포함하며, 아이디와 비밀번호의 설정 등 회원가입 절차를 거쳐 샌들즈로부터 회원으로 인정받은 “개인회원“을 말합니다.
    4. “닉네임“이라 함은 회원가입 시 회원의 식별과 회원의 콘텐츠 이용을 위하여 “회원“이 선정하는 닉네임을 말합니다.

    **제 3조 약관의 명시와 개정**

    1. 회사는 본 약관의 내용과 상호, 팀 명 등을 회원이 알 수 있도록 앱 내 화면에 게시하거나 기타의 방법으로 회원에게 공지합니다.
    2. 회사는 약관의 규제에 관한 법률, 콘텐츠산업 진흥법, 소비자 기본법, 전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관련 법령을 위반하지 않는 범위에서 이 약관을 개정할 수 있습니다.
    3. 회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 그 개정약관의 적용일자 7일 전부터 시행일 이후 상당한 기간 동안 본 콘텐츠 페이지에 게시하며, 개정된 약관은 그 시행일에 효력이 발생합니다. 단 개정 내용이 회원의 권리, 의무에 중대한 영향을 주는 변경의 경우에는 적용일자 30일 전부터 시행일 이후 상당한 기간 동안 본 콘텐츠 페이지에 게시하거나 팝업화면을 게시하는 등 회원이 충분히 인지할 수 있는 방법으로 공지하며, 개정된 약관은 그 시행일에 효력이 발생합니다.
    4. 회원은 변경된 약관에 대해 거부할 권리가 있습니다. 회원이 개정약관에 동의하지 않을 경우 회원은 이용 계약을 해지할 수 있습니다. 만약, 전항에 따라 회사가 약관 개정을 회원에게 통지하면서 공지일로부터 개정약관 시행일까지 거부의사를 표명하지 아니하거나 시행일 이후 콘텐츠를 이용하는 경우에는 동의한 것으로 간주합니다.

    **제 4조 약관의 해석**

    1. 본 약관에서 규정하지 않은 사항에 관해서는 약관의 규제에 관한 법률, 전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등의 관계법령에 따릅니다.
    2. 각 사이트 및 콘텐츠 이용약관이 있는 경우에는 콘텐츠 이용약관이 우선합니다.
    3. 회원이 샌들즈와 개별 계약을 체결하여 콘텐츠를 이용하는 경우에는 개별 계약이 우선합니다.

    **제 5조 약관 동의 및 콘텐츠 이용계약의 체결**

    1. 회사와 회원 간의 콘텐츠 이용계약은 이용자가 본 약관 내용에 대해 동의하고 콘텐츠 이용신청을 하면 회사가 그 신청을 승낙함으로써 성립합니다.
    2. 회사는 이용자가 콘텐츠 회원가입 페이지의 “동의” 또는 “확인” 버튼을 누르거나 이용자가 본 콘텐츠의 이용을 시작한 경우 본 약관에 동의한 것으로 간주합니다. 외부 서비스와의 연동을 통해 이용계약을 신청할 경우, 본 약관과 개인정보취급방침, 콘텐츠 제공을 위해 회사가 회원의 외부 서비스 계정 정보 접근 및 활용에 “동의” 또는 “확인” 버튼을 누름으로써 이용계약이 성립합니다.
    3. 회사는 이용자가 필수사항 등을 성실히 입력하여 콘텐츠 이용신청을 완료하였을 때에는 신청 내용을 확인한 후 지체 없이 이를 승낙하여야 합니다. 단, 회사는 아래에 해당하는 경우에는 승낙을 유보할 수 있습니다.
        1. 콘텐츠의 설비용량에 현실적인 여유가 없는 경우
        2. 콘텐츠를 제공하기에는 기술적으로 문제가 있다고 판단되는 경우
        3. 기타 샌들즈의 귀책사유로 이용승낙이 곤란한 경우

    **제 6조 개인정보의 보호 및 관리**

    1. 회사는 콘텐츠를 제공하기 위하여 회원으로부터 콘텐츠 이용에 필요한 개인정보를 수집할 수 있습니다.
    2. 회사는 관련 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력하며, 회원의 개인정보 보호 및 사용에 대해서는 회사가 별도로 고지하는 개인정보 처리방침을 적용합니다.
    3. 회사는 회사의 귀책 없이 회원의 귀책사유로 인하여 회원의 정보가 노출된 경우 이에 대해서는 책임을 지지 않습니다.

    **제 7조 회원의 의무**

    1. 회원은 본 콘텐츠 이용 중 아래 각 호에 해당하는 행위를 하여서는 안됩니다.
        1. 다른 회원의 아이디를 부정 사용하는 행위
        2. 범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위
        3. 타인의 명예를 훼손하거나 모욕하는 행위
        4. 타인의 지적재산권 등의 권리를 침해하는 행위
        5. 해킹행위 또는 바이러스의 유포 행위
        6. 타인의 의사에 반하여 광고성 정보 등 일정한 내용을 계속적으로 전송 또는 게시하는 행위
        7. 회사의 콘텐츠에 게시된 정보를 변경하거나 이용하여 영리 또는 비영리의 목적으로 복제, 출판, 방송 등에 사용하거나 제3자에게 제공하는 행위
        8. 콘텐츠의 안정적인 운영에 지장을 주거나 줄 우려가 있다고 판단되는 행위
        9. 다른 회원의 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
        10. 회사의 직원이나 콘텐츠의 관리자를 가장하거나 사칭하여 또는 타인의 명의를 도용하여 게시물 등을 작성하거나 이메일을 발송하는 행위
        11. 그밖에 선량한 풍속, 기타 사회질서를 해하거나 관계법령에 위반하는 행위
    2. 회사는 회원이 전항 각 호의 행위를 하는 경우 해당 게시물 등을 삭제 또는 임시조치할 수 있고 회원의 콘텐츠 이용을 제한하거나 그 사유가 중대한 경우 일방적으로 본 계약을 해지할 수 있습니다.
    3. 회원은 관계법령과 본 약관의 규정 및 기타 회사가 통지하는 사항을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 해서는 안 됩니다. 회원이 본 조 제1항 각 호의 행위를 함으로써 회사에 손해가 발생한 경우, 회사는 해당 회원에 대해 손해배상을 청구할 수 있습니다.
    4. 본 콘텐츠 내에서 회사의 관여 없이 회원간 이루어지는 일체의 행위(거래 행위 포함)와 관련하여 발생하는 모든 의무와 책임은 해당 회원에게 있으며, 회사는 그 내용에 대하여 책임을 지지 않습니다.

    **제 8조 콘텐츠 이용의 제한 및 중지**

    1. 회사는 아래 각 호에 해당하는 사유가 발생한 경우에는 회원의 콘텐츠 이용을 제한하거나 중지시킬 수 있습니다.
        1. 회원이 회사의 콘텐츠 운영을 고의 또는 과실로 방해하는 경우
        2. 회원이 제7조의 의무를 위반한 경우
        3. 기타 중대한 사유로 인하여 회사가 해당 회원에 대해 콘텐츠 제공을 지속하는 것이 상당하지 않다고 판단되는 경우
    2. 회사는 전항의 규정에 의하여 콘텐츠의 이용을 제한하거나 중지한 때에는 그 사유 및 제한 기간 등을 회원에게 알립니다.

    **제 9조 콘텐츠의 내용**

    1. **샌들즈**은 제2조 2항의 콘텐츠를 제공할 수 있으며 그 내용은 다음 각 호와 같다.
        1. 타 회원의 게시글 조회 콘텐츠
        2. 타 회원의 댓글 조회 콘텐츠
        3. 기타 **샌들즈**가 제휴계약 등을 통해 회원에게 제공하는 일체의 콘텐츠
    2. 회사는 필요한 경우 콘텐츠의 내용을 추가 또는 변경할 수 있습니다. 단, 이 경우 회사는 추가 또는 변경 내용을 회원에게 공지해야 합니다.

    **제 10조 계정의 관리책임**

    회원은 본인의 계정 관리에 대한 책임을 부담하며, 본인 계정을 제3자가 무단 이용하는 등 회원의 귀책사유로 인해 발생하는 모든 불이익에 대한 책임을 부담합니다.

    **제 11조 양도금지**

    회원이 콘텐츠의 이용권한, 기타 이용계약 상 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습비다.

    **제 12조 이용계약의 해지**

    1. 회원이 본 콘텐츠 이용계약을 해지하고자 하는 때에는 회사가 제공하는 콘텐츠 내의 회원탈퇴 기능을 이용하여 탈퇴를 요청할 수 있습니다. 회사는 탈퇴를 요청한 시점에서 불가피한 사정이 없는 한 즉시 탈퇴 요청을 처리합니다.
    2. 본 이용 계약이 해지된 경우 회원의 데이터 등은 삭제됩니다.

    **제 13조 면책조항**

    1. 회사는 다음 각 호의 사유로 콘텐츠를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.
        1. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우
        2. 제3자의 고의적인 콘텐츠 방해가 있는 경우
        3. 회원의 귀책사유로 콘텐츠 이용에 장애가 발생한 경우
        4. 제1호 내지 제3호를 제외한 기타 회사의 고의, 과실이 없는 사유로 콘텐츠를 제공하는 것이 어려운 경우
    2. 회사는 회원이 작성하여 콘텐츠에 게재된 정보 및 자료의 신뢰도나 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 회원의 손해에 대하여는 책임을 부담하지 아니합니다.

    **제 14조 정보의 제공 및 광고의 게재**

    1. 회사는 회원에게 콘텐츠 이용에 필요가 있다고 인정되거나 콘텐츠 개선 및 회원 대상의 콘텐츠 소개 등의 목적으로 하는 각종 정보에 대해서 전자우편을 이용한 방법으로 제공할 수 있습니다.
    2. 회사는 제공하는 콘텐츠와 관련되는 정보 또는 광고를 콘텐츠 화면, 전자우편 등에 게재할 수 있으며, 광고가 게재된 전자우편을 수신한 회원은 수신거절을 회사에게 할 수 있습니다.
    3. 회사는 콘텐츠상에 게재되어 있거나 본 콘텐츠를 통한 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래를 함으로써 발생하는 모든 손실과 손해에 대해 책임을 지지 않습니다.
    4. 본 콘텐츠의 회원은 콘텐츠 이용 시 노출되는 광고게재에 대해 동의 하는 것으로 간주합니다.

    **제 15조 분쟁의 해결**

    1. 회사와 회원은 콘텐츠와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 하여야 합니다.
    2. 전항의 노력에도 불구하고, 동 분쟁에 관한 소송은 회사의 주소지 관할법원으로 합니다.

    **제 16조 준거법 및 재판관할**

    1. 본 약관은 대한민국법에 의하여 규정되고 이행되며, 회사와 회원 간에 제기된 소송에는 대한민국법을 적용합니다.
    2. 콘텐츠 이용과 관련하여 회사와 회원 간에 발생한 분쟁은 서울중앙지방법원 또는 민사소송법 상의 관할법원에 제기합니다.

    **제 17조 사용시 주의해야 할 점**

    **샌들즈**는 사용자가 아래와 같이 잘못된 방법이나 행위로 콘텐츠를 이용할 경우 사용에 대한 제재(이용정지, 강제탈퇴 등)를 가할 수 있습니다.

    1. 잘못된 방법으로 콘텐츠의 제공을 방해하거나 회사가 안내하는 방법 이외의 다른 방법을 사용하여 **샌들즈** 콘텐츠에 접근하는 행위
    2. 다른 이용자의 정보를 무단으로 수집, 이용하거나 다른 사람들에게 제공하는 행위
    3. 콘텐츠를 영리나 홍보 목적으로 이용하는 행위
    4. 음란 정보나 저작권 침해 정보 등 공서양속 및 법령에 위반되는 내용의 정보 등을 발송하거나 게시하는 행위
    5. **샌들즈**의 동의 없이 **샌들즈** 콘텐츠 또는 이에 포함된 소프트웨어의 일부를 복사, 수정, 배포, 판매, 양도, 대여, 담보제공하거나 타인에게 그 이용을 허락하는 행위
    6. 소프트웨어를 역설계하거나 소스 코드의 추출을 시도하는 등 **샌들즈** 콘텐츠를 복제, 분해 또는 모방하거나 기타 변형하는 행위
    7. 관련 법령, **샌들즈**의 모든 약관 또는 운영정책을 준수하지 않는 행위

    **제 18조 개인정보 보호 관련**

    개인정보는 콘텐츠의 원활한 제공을 위하여 사용자가 동의한 목적과 범위 내에서만 이용됩니다. 개인정보 보호 관련 기타 상세한 사항은 **샌들즈** 개인정보처리방침을 참고하시기 바랍니다.

    **제 19조 게시물의 저작권 보호**

    1. 콘텐츠 사용자가 콘텐츠 내에 게시한 게시물의 저작권은 해당 게시물의 저작자에게 귀속됩니다.
    2. 사용자가 콘텐츠 내에 게시하는 게시물은 검색결과 내지 콘텐츠 및 관련 프로모션, 광고 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, **샌들즈**은 저작권법 규정을 준수하며, 사용자는 언제든지 고객센터 또는 운영자 문의 기능을 통해 해당 게시물에 대해 삭제, 검색결과 제외, 비공개 등의 조치를 요청할 수 있습니다.

    위 2항 이외의 방법으로 사용자의 게시물을 이용하고자 하는 경우에는 전화, 팩스, 전자우편 등을 통해 사전에 사용자의 동의를 얻어야 합니다.

    **제 20조 게시물의 관리**

    1. 사용자의 게시물이 "정보통신망법" 및 "저작권법"등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 회사는 관련법에 따라 조치를 취하여야 합니다.
    2. 회사는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 게시물에 대해 임시조치(삭제, 노출제한, 게시중단) 등을 취할 수 있습니다.

    **제 21조 사용권리**

    회사는 상표 및 로고를 사용할 권리를 사용자분들에게 부여하지 않습니다.

    **제 22조 콘텐츠 고지 및 홍보내용 표시**

    회사는 콘텐츠 사용자분의 편의를 위해 콘텐츠 이용과 관련된 각종 고지 및 기타 **샌들즈** 콘텐츠 홍보를 포함한 다양한 정보를 **샌들즈** 콘텐츠에 표시하거나 사용자의 휴대폰 문자, 알림 메시지(Push Notification) 등으로 발송할 수 있으며 콘텐츠 사용자분은 이에 동의합니다. 이 경우 콘텐츠 사용자분의 통신환경 또는 요금구조에 따라 콘텐츠 사용자분이 데이터 요금 등을 부담할 수 있습니다. 한편 회사는 콘텐츠 사용자분이 수집에 동의한 콘텐츠 내 활동 정보를 기초로 회사에게 직접적인 수익이 발생하지 않거나 회사가 판매하는 상품과 직접적인 관련성이 없는 한도에서 다른 콘텐츠 사용자분 등이 판매하는 상품 또는 콘텐츠에 관한 정보를 위와 같은 방법으로 콘텐츠 사용자분에게 보낼 수 있으며 콘텐츠 사용자분은 이에 동의합니다. 물론 콘텐츠 사용자분은 관련 법령상 필요한 내용을 제외하고 언제든지 이러한 정보에 대한 수신 거절을 할 수 있으며, 이 경우 회사는 즉시 위와 같은 정보를 보내는 것을 중단합니다.

    **제 23조 콘텐츠 중단**

    **샌들즈** 콘텐츠는 장비의 유지∙보수를 위한 정기 또는 임시 점검 또는 다른 상당한 이유로 **샌들즈** 콘텐츠의 제공이 일시 중단될 수 있습니다.

    **제 24조 이용계약 해지(콘텐츠 탈퇴)**

    사용자가 **샌들즈** 콘텐츠의 이용을 더 이상 원치 않는 때에는 언제든지 콘텐츠 내 제공되는 메뉴를 이용하여 콘텐츠 이용계약의 해지 신청을 할 수 있으며, 회사는 법령이 정하는 바에 따라 신속히 처리하겠습니다. 다만, 거래사기 등의 부정이용 방지를 위해 거래를 진행중이거나 거래 관련 분쟁이 발생한 사용자는 이용계약 해지 및 콘텐츠 탈퇴가 특정 기간 동안 제한될 수 있습니다. 이용계약이 해지되면 법령 및 개인정보처리방침에 따라 사용자 정보를 보유하는 경우를 제외하고는 사용자 정보나 사용자가 작성한 게시물 등 모든 데이터는 삭제됩니다. 다만, 사용자가 작성한 게시물이 제3자에 의하여 스크랩 또는 다른 공유 기능으로 게시되거나, 사용자가 제3자의 게시물에 댓글, 채팅 등 게시물을 추가하는 등의 경우에는 다른 이용자의 정상적 콘텐츠 이용을 위하여 필요한 범위 내에서 **샌들즈** 콘텐츠 내에 삭제되지 않고 남아 있게 됩니다.

    **제 25조 책임제한**

    회사는 법령상 허용되는 한도 내에서 **샌들즈** 콘텐츠와 관련하여 본 약관에 명시되지 않은 어떠한 구체적인 사항에 대한 약정이나 보증을 하지 않습니다. 예를 들어, 콘텐츠, 콘텐츠의 특정 기능, 콘텐츠의 이용가능성에 대하여 어떠한 약정이나 보증을 하는 것이 아니며, **샌들즈** 콘텐츠를 있는 그대로 제공할 뿐입니다.

    **제 26조 약관수정**

    회사는 법률이나 콘텐츠의 변경사항을 반영하기 위한 목적 등으로 본 약관이나 **샌들즈** 콘텐츠 이용방법, 해당 안내 및 고지사항을 수정할 수 있습니다. 변경된 약관은 게시한 날로부터 7일 후부터 효력이 발생합니다.

    회사는 변경된 약관을 게시한 날로부터 효력이 발생되는 날까지 약관변경에 대한 사용자의 의견을 기다리겠습니다. 위 기간이 지나도록 사용자의 의견이 회사에 접수되지 않으면, 사용자가 변경된 약관에 따라 콘텐츠를 이용하는 데에 동의하는 것으로 보겠습니다. 사용자가 변경된 약관에 동의하지 않는 경우 변경된 약관의 적용을 받는 해당 콘텐츠의 제공이 더 이상 불가능하게 됩니다.

    **제 27조 사용자 의견**

    회사는 사용자의 의견을 소중하게 생각합니다. 사용자는 언제든지 콘텐츠 내 제안하기 기능을 통해 의견을 개진할 수 있습니다. **샌들즈**은 푸시 알림, 채팅 방법, 휴대폰 번호 등으로 사용자에게 여러 가지 소식을 알려드리며, 사용자 전체에 대한 통지는 **샌들즈** 콘텐츠 초기화면 또는 공지사항 란에 게시함으로써 효력이 발생합니다.

    본 약관은 회사와 사용자와의 관계에 적용되며, 제3자의 수익권을 발생시키지 않습니다.

    사용자가 본 약관을 준수하지 않은 경우에, 회사가 즉시 조치를 취하지 않더라도 회사가 가지고 있는 권리를 포기하는 것이 아니며, 본 약관 중 일부 조항의 집행이 불가능하게 되더라도 다른 조항에는 영향을 미치지 않습니다.

    본 약관 또는 **샌들즈** 콘텐츠와 관련하여서는 대한민국의 법률이 적용됩니다.

    공고일자: 2022년 11월 06일
    시행일자: 2022년 11월 06일
    """
    
}
