//
//  test.swift
//  Kindy
//
//  Created by 정호윤 on 2022/11/08.
//

import Foundation

//let curations = [
//    Curation(id: "1", title: "B급 취향,", subTitle: "감각적인 인테리어와 디저트 메뉴가 돋보이는 독립서점", mainImage: "B급취향_Curation1", headText: """
//         누구도 배제하지 않고 누구나 머무를 수 있는 공간을 제공하고 싶다는 슬로건으로 책방을 운영하고 계십니다.\n
//         책 큐레이션은 물론이고 비건을 위한 디저트도 준비되어 사장님이 책방에 진심이라는 것이 모든 곳에서 느껴진다.\n
//         덧붙이자면 사장님께서 너무 유쾌하셔서 서점에서 주최하는 클래스 프로그램에 참여해보시길 꼭 추천드리고 싶다.\n
//         10월22일 B급취향의 돌잔치가 개최된다니 궁금하시면 B급취향 인스타그램을 참고하시길!(킨디에서 자세한 정보를 찾아보시길..이면 좋겠다)\n
//         """, imageWithText: [("B급취향_Curation1", ""), ("B급취향_Curation2", ""), ("B급취향_Curation3", "")], infoText: """
//         포항시 북구 장량로 241번길 12, 1층\n
//         월-수 12:00-19:00 목-토 12:00-20:00 일 12:00-18:00\n
//         인스타그램 https://www.instagram.com/b_ook_taste/\n
//         유튜브 https://youtu.be/ne25n4EHsgQ\n\n
//         #B급취향#포항#포항북구#양덕동#독립서점#북카페#인테리어#카페#비건#페미니즘#환경#클래스
//         """, bookStore: bookstoreDummy[0]),
//
//         Curation(id: "2", title: "한가로운 일상,", subTitle: "잠시 쉬어갈 분들에게", mainImage: "두두디북스1", headText: "📚 두두디북스 | 부산 수영구 \n\n✏️ 출입문부터 시작해 내부 인테리어까지 프라이빗한 아지트에 온 것 같은 느낌이 들었다.
// 공간이 생각보다 굉장히 넓었고, 펍 운영 공간은 이전에 생각하던 서점 분위기와는 반전되는 느낌이라 신선하고 재밌었다.
// 2016년부터 계속 자리를 지키고 있는 만큼 ‘만남’에 진심인 이 곳에서는 굉장히 다양한 클래스들을 개최하고 있어 부산에 계신 분이라면 시간을 내어 참여해봐도 좋을 것 같다", imageWithText: [("두두디북스1", ""), ("두두디북스2", ""), ("두두디북스3", ""), ("두두디북스4", "")], infoText: """
//             주중 무인 운영(월-금),토 PM 1시~7시, 일 PM 1시~7시\n
//             부산광역시 수영구 수영로510번길 43 (광안동, 광남빌라) 지하 1층\n
//             인스타그램 https://www.instagram.com/doodoodibooks\n\n
//             #두두디북스#부산#수영구#독립서점#전시#공연#북토크#펍#바#카페
//             """, bookStore: bookstoreDummy[10]),
//
//         Curation(id: "3", title: "한가로운 일상,", subTitle: "잠시 쉬어갈 장소가 필요한 분들에게", mainImage: "밤산책방1", headText: """
//             밤산책방\n
//             무인서점이라 서서 반겨주는 사람은 없었지만 서점 내 곳곳에 비치된 안내 문구에서 세심한 배려가 느껴져 기분 좋았다.\n
//             어느날 조용한 위로를 받고싶은 날이 찾아 온다면 새벽 내내 따뜻한 불을 밝히고 있는 밤산책방으로 가보는 것을 추천한다.\n
//             """, imageWithText: [("밤산책방1", ""), ("밤산책방2", ""), ("밤산책방3", ""), ("밤산책방4", "")], infoText: """
//                  금토일\n
//                  부산광역시 수영구 수영로510번길 42 지하1층\n
//                  인스타그램 https://www.instagram.com/bam_sanchaek_bang/\n\n
//                  #밤산책방#부산#수영구#독립서점#무인서점#24시간서점#주말#공휴일
//                 """, bookStore: bookstoreDummy[9])
//     ]
//]
